Repository: Anwar-tad/hulun_beand
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Oromo
am: ኦሮምኛ

source: Inbox
am: የገቢ መልዕክት

source: Post Item
am: እቃ ለጥፍ

source: Logout
am: ውጣ

source: Login
am: ይግቡ

source: Register
am: ይመዝገቡ

source: Post Your Item
am: እቃዎን ይለጥፉ

source: Welcome to
am: እንኳን ደህና መጡ ወደ

source: All in One Place
am: ሁሉን በአንድ ቦታ

source: Buy what you want, sell what you don't. Simple, fast, and reliable.
am: የሚፈልጉትን ይግዙ፣ የማይፈልጉትን ይሽጡ። ቀላል፣ ፈጣን እና አስተማማኝ።

source: Search here (e.g., Toyota Vitz)
am: እዚህ ይፈልጉ (ለምሳሌ፡ Toyota Vitz)

source: Browse by Category
am: በምድብ ያስሱ

source: Showing items in
am: እቃዎች የታዩት በ

source: Back to all categories
am: ወደ ሁሉም ምድቦች ተመለስ

source: Search results for
am: የፍለጋ ውጤቶች ለ

source: Latest Products
am: አዳዲስ እቃዎች

source: Price
am: ዋጋ

source: Seller
am: ሻጭ

source: No products found matching your criteria.
am: ከፍለጋዎ ጋር የሚዛመድ ምንም እቃ አልተገኘም።

source: Previous
am: ቀዳሚ

source: Next
am: ቀጣይ

source: Welcome Back!
am: እንኳን በደህና ተመለሱ!

source: Log in to discover great deals, or post your own items for sale. Your next opportunity is just a click away.
am: ድንቅ ቅናሾችን ለማግኘት ወይም የራስዎን እቃዎች ለሽያጭ ለመለጠፍ ይግቡ። ቀጣዩ እድልዎ አንድ ክሊክ ርቀት ላይ ነው።

source: Log In
am: ይግቡ

source: Username
am: የተጠቃሚ ስም

source: Enter your password
am: የይለፍ ቃልዎን ያስገቡ

source: Password Reset Complete
am: የይለፍ ቃል ለውጥ ተጠናቋል

source: Your password has been set. You may go ahead and log in now.
am: የይለፍ ቃልዎ ተቀይሯል። አሁን መግባት ይችላሉ።

source: Log in
am: ይግቡ

source: Enter New Password
am: አዲስ የይለፍ ቃል ያስገቡ

source: Change Password
am: የይለፍ ቃል ቀይር

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
am: የይለፍ ቃል መቀየሪያ ሊንኩ የተሳሳተ ነው፤ ምናልባት ከዚህ በፊት ጥቅም ላይ ውሎ ሊሆን ይችላል። እባክዎ እንደ አዲስ ይጠይቁ።

source: Reset Email Sent
am: የይለፍ ቃል መቀየሪያ ኢሜይል ተልኳል

source: Check your inbox.
am: የእርስዎን የኢሜይል ገቢ መልዕክት ሳጥን ይመልከቱ።

source: We've emailed you instructions for setting your password. You should receive the email shortly!
am: የይለፍ ቃልዎን እንዴት መቀየር እንደሚችሉ መመሪያ በኢሜይል ልከንልዎታል። በቅርቡ ይደርስዎታል!

source: Reset Password
am: የይለፍ ቃል ዳግም ያስጀምሩ

source: Enter your email address below, and we'll email instructions for setting a new one.
am: ከታች የኢሜይል አድራሻዎን ያስገቡ፤ አዲስ የይለፍ ቃል ለማዘጋጀት መመሪያ እንልክልዎታለን።

source: Send Reset Email
am: የመቀየሪያ ኢሜይል ላክ

source: Email Address
am: የኢሜይል አድራሻ

source: Enter your email
am: ኢሜይልዎን ያስገቡ

source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

source: Product Name
am: የእቃው ስም

source: Category
am: ምድብ

source: Brand
am: የእቃው ዓይነት/Brand

source: Condition
am: ሁኔታ

source: Location
am: የሚገኝበት ቦታ

source: Price (in Birr)
am: ዋጋ (በብር)

source: Description
am: መግለጫ

source: e.g., Samsung Galaxy S22
am: ለምሳሌ፡ ሳምሰንግ ጋላክሲ ኤስ 22

source: e.g., Samsung
am: ለምሳሌ፡ ሳምሰንግ

source: e.g., Addis Ababa, Bole
am: ለምሳሌ፡ አዲስ አበባ፣ ቦሌ

source: Price in Birr
am: ዋጋ በብር

source: Provide a detailed description...
am: ስለ እቃው ዝርዝር ማብራሪያ ያስገቡ...

source: Profile Picture
am: የፕሮፋይል ፎቶ

source: Bio
am: አጭር መግለጫ

source: Phone Number
am: ስልክ ቁጥር

source: e.g., 0911....
am: ለምሳሌ፡ 0911....

source: Brand New
am: አዲስ

source: Used
am: ያገለገለ

source: Refurbished
am: የታደሰ

source: Conversation about
am: ውይይት ስለ

source: Type your message...
am: መልዕክትዎን ይጻፉ...

source: Send
am: ላክ

source: Back to Inbox
am: ወደ ገቢ መልዕክቶች ተመለስ

source: Post a New Item
am: አዲስ እቃ ይለጥፉ

source: Upload Images
am: ፎቶዎችን ይስቀሉ

source: you can select multiple
am: ከአንድ በላይ መምረጥ ይችላሉ

source: Post Product
am: እቃውን ለጥፍ

source: My Inbox
am: የገቢ መልዕክት ሳጥኔ

source: Re:
am: ምላሽ ለ:

source: With:
am: ከ:

source: You:
am: እርስዎ:

source: You have no conversations yet.
am: እስካሁን ምንም አይነት ውይይት የለዎትም።

source: Delete Product
am: እቃን ሰርዝ

source: Are you sure you want to permanently delete the product "%(product.name)s"?
am: እርግጠኛ ነዎት "% (product.name)s" የተባለውን እቃ በቋሚነት መሰረዝ ይፈልጋሉ?

source: This action cannot be undone.
am: ይህንን ድርጊት መቀልበስ አይቻልም።

source: Yes, Delete
am: አዎ, ይሰረዝ

source: Cancel
am: አቁም

source: No Image Available
am: ምንም ፎቶ የለም።

source: Posted by:
am: የለጠፈው:

source: on
am: በ

source: Phone
am: ስልክ ቁ.

source: Show Contact
am: የግንኙነት መረጃ አሳይ

source: Chat with Seller
am: ከሻጩ ጋር ይወያዩ

source: Specifications
am: ዝርዝር መግለጫዎች

source: Like
am: ወድጀዋለሁ

source: Dislike
am: አልወደድኩትም

source: Edit
am: አስተካክል

source: Delete
am: ሰርዝ

source: Back to Home
am: ወደ መነሻ ገጽ ተመለስ

source: Related Products
am: ተመሳሳይ እቃዎች

source: No related products found in this category.
am: በዚህ ምድብ ውስጥ ምንም ተመሳሳይ እቃ አልተገኘም።

source: Update
am: እቃ አስተካክል

source: Update Your
am: እቃዎን ያዘምኑ

source: Current Images
am: ያሉ ፎቶዎች

source: No images uploaded yet.
am: እስካሁን የተሰቀለ ፎቶ የለም።

source: Upload New Images
am: አዲስ ፎቶዎችን ይስቀሉ

source: this will replace all current images
am: ይህ ያሉትን ፎቶዎች በሙሉ ይተካል

source: Save Changes
am: ለውጦችን አስቀምጥ

source: Profile
am: የተጠቃሚ መረጃ

source: Contact
am: የግንኙነት መረጃ

source: Edit Profile
am: ፕሮፋይል አስተካክል

source: Items posted by
am: የተለጠፉ እቃዎች በ

source: Edit Item
am: እቃ አስተካክል

source: Delete Item
am: እቃ ሰርዝ

source: has not posted any products yet.
am: እስካሁን ምንም አይነት እቃ አልለጠፈም።

source: Post Your First Item
am: የመጀመሪያ እቃዎን ይለጥፉ

source: Join Our Community!
am: ማህበረሰባችንን ይቀላቀሉ!

source: Create an account to start buying and selling in Ethiopia's fastest-growing marketplace.
am: በኢትዮጵያ በፍጥነት እያደገ ባለው የገበያ መድረክ ላይ መግዛትና መሸጥ ለመጀመር አካውንት ይፍጠሩ።

source: Create an Account
am: አካውንት ይፍጠሩ

source: Email
am: ኢሜይል

source: Messages
am: መልዕክቶች

source: Site Maps
am: የጣቢያ ካርታዎች

source: Static Files
am: የማይንቀሳቀሱ ፋይሎች

source: That page number is not an integer
am: ያ የገጽ ቁጥር ሙሉ ቁጥር አይደለም።

source: That page number is less than 1
am: ያ የገጽ ቁጥር ከ 1 ያነሰ ነው።

source: That page contains no results
am: ያ ገጽ ምንም ውጤት አልያዘም።

source: Enter a valid value.
am: ትክክለኛ እሴት ያስገቡ።

source: Enter a valid domain name.
am: ትክክለኛ የዶሜይን ስም ያስገቡ።

source: Enter a valid URL.
am: ትክክለኛ URL ያስገቡ።

source: Enter a valid integer.
am: ትክክለኛ ሙሉ ቁጥር ያስገቡ።

source: Enter a valid email address.
am: ትክክለኛ የኢሜይል አድራሻ ያስገቡ።

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
am: ደብዳቤዎች፣ ቁጥሮች፣ ከታች መስመሮች ወይም ሰረዞችን ያካተተ ትክክለኛ “slug” ያስገቡ።

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
am: ዩኒኮድ ደብዳቤዎችን፣ ቁጥሮችን፣ ከታች መስመሮችን ወይም ሰረዞችን ያካተተ ትክክለኛ “slug” ያስገቡ።

source: Enter a valid %(protocol)s address.
am: ትክክለኛ የሆነ %(protocol)s አድራሻ ያስገቡ።

source: IPv4
am: አይፒቪ4

source: IPv6
am: አይፒቪ6

source: IPv4 or IPv6
am: አይፒቪ4 ወይም አይፒቪ6

source: Enter only digits separated by commas.
am: በነጠላ ሰረዝ የተለዩ ቁጥሮችን ብቻ ያስገቡ።

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
am: ይህ እሴት %(limit_value)s መሆኑን ያረጋግጡ (እሴቱ %(show_value)s ነው።)

source: Ensure this value is less than or equal to %(limit_value)s.
am: ይህ እሴት ከ %(limit_value)s ጋር እኩል ወይም ከዚያ ያነሰ መሆኑን ያረጋግጡ።

source: Ensure this value is greater than or equal to %(limit_value)s.
am: ይህ እሴት ከ %(limit_value)s ጋር እኩል ወይም ከዚያ የሚበልጥ መሆኑን ያረጋግጡ።

source: Ensure this value is a multiple of step size %(limit_value)s.
am: ይህ እሴት የ %(limit_value)s ብዜት መሆኑን ያረጋግጡ።

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
am: ይህ እሴት የ %(limit_value)s ብዜት መሆኑን ያረጋግጡ፣ ከ %(offset)s ጀምሮ፣ ለምሳሌ %(offset)s, %(valid_value1)s, %(valid_value2)s እና የመሳሰሉት።

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
am: ይህ እሴት ቢያንስ %(limit_value)d ፊደል ወይም ቁጥር እንዳለው ያረጋግጡ (እሴቱ %(show_value)d ነው)።

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
am: ይህ እሴት ቢበዛ %(limit_value)d ፊደል ወይም ቁጥር እንዳለው ያረጋግጡ (እሴቱ %(show_value)d ነው)።

source: Enter a number.
am: ቁጥር ያስገቡ።

source: Ensure that there are no more than %(max)s digit in total.
am: በጠቅላላው ከ %(max)s በላይ አሃዝ አለመኖሩን ያረጋግጡ።

source: Ensure that there are no more than %(max)s decimal place.
am: ከ %(max)s በላይ የአስርዮሽ ቦታ አለመኖሩን ያረጋግጡ።

source: Ensure that there are no more than %(max)s digit before the decimal point.
am: ከአስርዮሽ ነጥቡ በፊት ከ %(max)s በላይ አሃዝ አለመኖሩን ያረጋግጡ።

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
am: የፋይል ቅጥያ “%(extension)s” አይፈቀድም። የተፈቀዱ ቅጥያዎች: %(allowed_extensions)s ናቸው።

source: Null characters are not allowed.
am: የባዶ ቁምፊዎች አይፈቀዱም።

source: %(model_name)s with this %(field_labels)s already exists.
am: %(model_name)s ከዚህ %(field_labels)s ጋር አስቀድሞ አለ።

source: Constraint “%(name)s” is violated.
am: ገደብ “%(name)s” ተጥሷል።

source: Value %(value)r is not a valid choice.
am: እሴት %(value)r ትክክለኛ ምርጫ አይደለም።

source: %(model_name)s with this %(field_label)s already exists.
am: %(model_name)s ከዚህ %(field_label)s ጋር አስቀድሞ አለ።

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
am: %(field_label)s ለ %(date_field_label)s %(lookup_type)s ልዩ መሆን አለበት።

source: Field of type: %(field_type)s
am: የመስክ አይነት: %(field_type)s

source: “%(value)s” value must be either True or False.
am: “%(value)s” እሴት እውነት ወይም ውሸት መሆን አለበት።

source: “%(value)s” value must be either True, False, or None.
am: “%(value)s” እሴት እውነት፣ ውሸት ወይም ባዶ መሆን አለበት።

source: Boolean (Either True or False)
am: ቦሊያን (እውነት ወይም ውሸት)

source: String (up to %(max_length)s)
am: ሕብረቁምፊ (እስከ %(max_length)s)

source: String (unlimited)
am: ሕብረቁምፊ (ያልተገደበ)

source: Comma-separated integers
am: በነጠላ ሰረዝ የተለዩ ሙሉ ቁጥሮች

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
am: “%(value)s” እሴት የተሳሳተ የቀን ቅርጸት አለው። በ YYYY-MM-DD ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (YYYY-MM-DD) አለው ግን ትክክለኛ ያልሆነ ቀን ነው።

source: Date (without time)
am: ቀን (ሰዓት የሌለው)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
am: “%(value)s” እሴት የተሳሳተ ቅርጸት አለው። በ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) አለው ግን ትክክለኛ ያልሆነ ቀን/ሰዓት ነው።

source: Date (with time)
am: ቀን (ሰዓት ያለው)

source: “%(value)s” value must be a decimal number.
am: “%(value)s” እሴት የአስርዮሽ ቁጥር መሆን አለበት።

source: Decimal number
am: የአስርዮሽ ቁጥር

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
am: “%(value)s” እሴት የተሳሳተ ቅርጸት አለው። በ [DD] [[HH:]MM:]ss[.uuuuuu] ቅርጸት መሆን አለበት።

source: File path
am: የፋይል መንገድ

source: “%(value)s” value must be a float.
am: “%(value)s” እሴት ተንሳፋፊ ነጥብ ቁጥር መሆን አለበት።

source: Floating point number
am: ተንሳፋፊ ነጥብ ቁጥር

source: “%(value)s” value must be an integer.
am: “%(value)s” እሴት ሙሉ ቁጥር መሆን አለበት።

source: Integer
am: ሙሉ ቁጥር

source: Big (8 byte) integer
am: ትልቅ (8 ባይት) ሙሉ ቁጥር

source: Small integer
am: ትንሽ ሙሉ ቁጥር

source: IPv4 address
am: አይፒቪ4 አድራሻ

source: “%(value)s” value must be either None, True or False.
am: “%(value)s” እሴት ባዶ፣ እውነት ወይም ውሸት መሆን አለበት።

source: Boolean (Either True, False or None)
am: ቦሊያን (እውነት፣ ውሸት ወይም ባዶ)

source: Positive big integer
am: አዎንታዊ ትልቅ ሙሉ ቁጥር

source: Positive integer
am: አዎንታዊ ሙሉ ቁጥር

source: Positive small integer
am: አዎንታዊ ትንሽ ሙሉ ቁጥር

source: Slug (up to %(max_length)s)
am: ስላግ (እስከ %(max_length)s)

source: Text
am: ጽሑፍ

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
am: “%(value)s” እሴት የተሳሳተ ቅርጸት አለው። በ HH:MM[:ss[.uuuuuu]] ቅርጸት መሆን አለበት።

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
am: “%(value)s” እሴት ትክክለኛ ቅርጸት (HH:MM[:ss[.uuuuuu]]) አለው ግን ትክክለኛ ያልሆነ ሰዓት ነው።

source: Time
am: ሰዓት

source: URL
am: ዩአርኤል

source: Raw binary data
am: ጥሬ ሁለትዮሽ መረጃ

source: “%(value)s” is not a valid UUID.
am: “%(value)s” ትክክለኛ UUID አይደለም።

source: Universally unique identifier
am: ሁለንተናዊ ልዩ መለያ

source: File
am: ፋይል

source: Image
am: ምስል

source: A JSON object
am: የ JSON ነገር

source: Value must be valid JSON.
am: እሴቱ ትክክለኛ JSON መሆን አለበት።

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
am: %(model)s ቅጂ ከ %(field)s %(value)r ጋር ትክክለኛ ምርጫ አይደለም።

source: Foreign Key (type determined by related field)
am: የውጭ ቁልፍ (አይነቱ ተዛማጅ በሆነው መስክ የሚወሰን)

source: One-to-one relationship
am: አንድ-ለ-አንድ ግንኙነት

source: %(from)s-%(to)s relationship
am: %(from)s-%(to)s ግንኙነት

source: %(from)s-%(to)s relationships
am: %(from)s-%(to)s ግንኙነቶች

source: Many-to-many relationship
am: ብዙ-ለ-ብዙ ግንኙነት

source: This field is required.
am: ይህ መስክ ያስፈልጋል።

source: Enter a whole number.
am: ሙሉ ቁጥር ያስገቡ።

source: Enter a valid date.
am: ትክክለኛ ቀን ያስገቡ።

source: Enter a valid time.
am: ትክክለኛ ሰዓት ያስገቡ።

source: Enter a valid date/time.
am: ትክክለኛ ቀን/ሰዓት ያስገቡ።

source: Enter a valid duration.
am: ትክክለኛ የጊዜ ርዝመት ያስገቡ።

source: The number of days must be between {min_days} and {max_days}.
am: የቀኖች ብዛት በ {min_days} እና {max_days} መካከል መሆን አለበት።

source: No file was submitted. Check the encoding type on the form.
am: ምንም ፋይል አልተላከም። በቅጹ ላይ ያለውን የምልክት አይነት (encoding) ያረጋግጡ።

source: No file was submitted.
am: ምንም ፋይል አልተላከም።

source: The submitted file is empty.
am: የተላከው ፋይል ባዶ ነው።

source: Ensure this filename has at most %(max)d character (it has %(length)d).
am: ይህ የፋይል ስም ቢበዛ %(max)d ፊደል ወይም ቁጥር እንዳለው ያረጋግጡ (እሴቱ %(length)d ነው)።

source: Please either submit a file or check the clear checkbox, not both.
am: እባክዎ ፋይል ይላኩ ወይም የጸዳ ሳጥኑን ይምረጡ፣ ሁለቱንም አይምረጡ።

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
am: ትክክለኛ ምስል ይስቀሉ። የሰቀሉት ፋይል ምስል ላይሆን ወይም የተበላሸ ሊሆን ይችላል።

source: Select a valid choice. %(value)s is not one of the available choices.
am: ትክክለኛ ምርጫ ይምረጡ። %(value)s ከሚገኙት ምርጫዎች አንዱ አይደለም።

source: Enter a list of values.
am: የእሴቶች ዝርዝር ያስገቡ።

source: Enter a complete value.
am: ሙሉ እሴት ያስገቡ።

source: Enter a valid UUID.
am: ትክክለኛ ዩዩአይዲ (UUID) ያስገቡ።

source: Enter a valid JSON.
am: ትክክለኛ ጄሰን (JSON) ያስገቡ።

source: (Hidden field %(name)s) %(error)s
am: (የተደበቀ መስክ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
am: የማኔጅመንት ፎርም (ManagementForm) መረጃ ጠፍቷል ወይም ተዛብቷል። የጎደሉ መስኮች: %(field_names)s። ችግሩ ከቀጠለ የሳንካ ሪፖርት (bug report) ማቅረብ ሊያስፈልግዎ ይችላል።

source: Please submit at most %(num)d form.
am: እባክዎ ቢበዛ %(num)d ቅጽ ይላኩ።

source: Please submit at least %(num)d form.
am: እባክዎ ቢያንስ %(num)d ቅጽ ይላኩ።

source: Order
am: ቅደም ተከተል

source: Please correct the duplicate data for %(field)s.
am: እባክዎ ለ %(field)s የተደጋገመውን መረጃ ያስተካክሉ።

source: Please correct the duplicate data for %(field)s, which must be unique.
am: እባክዎ ለ %(field)s ልዩ መሆን ያለበትን የተደጋገመ መረጃ ያስተካክሉ።

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
am: እባክዎ ለ %(field_name)s የተደጋገመውን መረጃ ያስተካክሉ። ይህም በ %(date_field)s ውስጥ ለ %(lookup)s ልዩ መሆን አለበት።

source: Please correct the duplicate values below.
am: እባክዎ ከታች ያሉትን የተደጋገሙ እሴቶች ያስተካክሉ።

source: The inline value did not match the parent instance.
am: የውስጠኛው እሴት ከወላጅ ቅጂው ጋር አይመሳሰልም።

source: Select a valid choice. That choice is not one of the available choices.
am: ትክክለኛ ምርጫ ይምረጡ። ያ ምርጫ ከሚገኙት ምርጫዎች አንዱ አይደለም።

source: “%(pk)s” is not a valid value.
am: “%(pk)s” ትክክለኛ እሴት አይደለም።

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
am: %(datetime)s በጊዜ ሰቅ %(current_timezone)s ውስጥ ሊተረጎም አልቻለም፤ ግልጽ ያልሆነ ወይም የሌለ ሊሆን ይችላል።

source: Clear
am: አጥፋ

source: Unknown
am: ያልታወቀ

source: Yes
am: አዎ

source: No
am: አይ

source: yes,no,maybe
am: አዎ፣አይ፣ምናልባት

source: %(size)d byte
am: %(size)d ባይት

source: %s KB
am: %s ኪ.ባ.

source: %s MB
am: %s ሜ.ባ.

source: %s GB
am: %s ጊ.ባ.

source: %s TB
am: %s ቴ.ባ.

source: %s PB
am: %s ፒ.ባ.

source: p.m.
am: ከሰዓት

source: a.m.
am: ጥዋት

source: PM
am: ከሰዓት

source: AM
am: ጥዋት

source: midnight
am: እኩለ ሌሊት

source: noon
am: እኩለ ቀን

source: Monday
am: ሰኞ

source: Tuesday
am: ማክሰኞ

source: Wednesday
am: ረቡዕ

source: Thursday
am: ሐሙስ

source: Friday
am: አርብ

source: Saturday
am: ቅዳሜ

source: Sunday
am: እሁድ

source: Tue
am: ማክ

source: Wed
am: ረቡ

source: Thu
am: ሐሙ

source: Fri
am: አርብ

source: Sat
am: ቅዳ

source: Sun
am: እሁ

source: January
am: ጥር

source: February
am: የካቲት

source: March
am: መጋቢት

source: April
am: ሚያዝያ

source: May
am: ግንቦት

source: June
am: ሰኔ

source: July
am: ሐምሌ

source: August
am: ነሐሴ

source: September
am: መስከረም

source: October
am: ጥቅምት

source: December
am: ታህሳስ

source: jan
am: ጥር

source: feb
am: የካ

source: apr
am: ሚያ

source: may
am: ግን

source: jun
am: ሰኔ

source: jul
am: ሐም

source: aug
am: ነሐ

source: sep
am: መስ

source: nov
am: ህዳ

source: dec
am: ታህ

# abbrev. month
source: Jan.
am: ጥር

# abbrev. month
source: Feb.
am: የካ

# abbrev. month
source: March
am: መጋቢት

# abbrev. month
source: April
am: ሚያዝያ

# abbrev. month
source: May
am: ግንቦት

# abbrev. month
source: June
am: ሰኔ

# abbrev. month
source: July
am: ሐምሌ

# abbrev. month
source: Aug.
am: ነሐሴ

# abbrev. month
source: Sept.
am: መስከረም

# abbrev. month
source: Oct.
am: ጥቅምት

# abbrev. month
source: Nov.
am: ህዳር

# abbrev. month
source: Dec.
am: ታህሳስ

# alt. month
source: January
am: ጥር

# alt. month
source: February
am: የካቲት

# alt. month
source: March
am: መጋቢት

# alt. month
source: April
am: ሚያዝያ

# alt. month
source: May
am: ግንቦት

# alt. month
source: June
am: ሰኔ

# alt. month
source: July
am: ሐምሌ

# alt. month
source: August
am: ነሐሴ

# alt. month
source: September
am: መስከረም

# alt. month
source: October
am: ጥቅምት

# alt. month
source: December
am: ታህሳስ

source: This is not a valid IPv6 address.
am: ይህ ትክክለኛ አይፒቪ6 አድራሻ አይደለም።

source: or
am: ወይም

source: %(num)d year
am: %(num)d ዓመት

source: %(num)d month
am: %(num)d ወር

source: %(num)d week
am: %(num)d ሳምንት

source: %(num)d day
am: %(num)d ቀን

source: %(num)d hour
am: %(num)d ሰዓት

source: %(num)d minute
am: %(num)d ደቂቃ

source: Forbidden
am: የተከለከለ

source: CSRF verification failed. Request aborted.
am: የሲኤስአርኤፍ (CSRF) ማረጋገጫ አልተሳካም። ጥያቄው ተቋርጧል።

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
am: ይህንን መልዕክት እያዩ ያሉት ይህ የኤችቲቲፒኤስ (HTTPS) ድረ-ገጽ የ“Referer header”ን አድራሻ ከድር አሳሽዎ መላክን ስለሚፈልግ ግን አድራሻው ስላልተላከ ነው። ይህ አድራሻ ለደህንነት ምክንያቶች ያስፈልጋል።

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
am: ድር አሳሽዎ የ“Referer” አድራሻዎችን እንዳይልክ ካዋቀሩት፣ እባክዎ እንደገና ያንቁት፤ ቢያንስ ለዚህ ድረ-ገጽ፣ ለኤችቲቲፒኤስ ግንኙነቶች ወይም ለ“same-origin” ጥያቄዎች።

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
am: የ<meta name="referrer" content="no-referrer"> ታግ ወይም የ“Referrer-Policy: no-referrer” አድራሻን የሚጠቀሙ ከሆነ፣ እባክዎ ያስወግዱት። የሲኤስአርኤፍ ጥበቃ ጥብቅ ማረጋገጫ ለማድረግ የ“Referer” አድራሻውን ይፈልጋል። ስለግላዊነትዎ የሚያሳስብዎት ከሆነ ወደ ሌሎች ድረ-ገጾች ለመሄድ <a rel="noreferrer" …>ን ይጠቀሙ።

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
am: ይህንን መልዕክት እያዩ ያሉት ይህ ድረ-ገጽ ቅጾችን ሲያስገቡ የሲኤስአርኤፍ ኩኪን ስለሚፈልግ ነው። ይህ ኩኪ የሚያስፈልገው ለደህንነት ሲባል የድር አሳሽዎ በሌሎች ወገኖች እንዳይጠለፍ ለማረጋገጥ ነው።

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
am: ድር አሳሽዎን ኩኪዎችን እንዳይጠቀም ካዋቀሩት፣ እባክዎ እንደገና ያንቁት፤ ቢያንስ ለዚህ ድረ-ገጽ ወይም ለ“same-origin” ጥያቄዎች።

source: More information is available with DEBUG=True.
am: ተጨማሪ መረጃ በ DEBUG=True ይገኛል።

source: No year specified
am: ምንም ዓመት አልተገለጸም።

source: Date out of range
am: ቀን ከክልል ውጭ ነው

source: No month specified
am: ምንም ወር አልተገለጸም።

source: No day specified
am: ምንም ቀን አልተገለጸም።

source: No week specified
am: ምንም ሳምንት አልተገለጸም።

source: No %(verbose_name_plural)s available
am: ምንም %(verbose_name_plural)s አይገኝም።

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
am: የወደፊት %(verbose_name_plural)s አይገኝም ምክንያቱም %(class_name)s.allow_future ውሸት ነው።

source: Invalid date string “%(datestr)s” given format “%(format)s”
am: ከተሰጠው ቅርጸት “%(format)s” ጋር ሲነጻጸር የተሳሳተ የቀን ሕብረቁምፊ “%(datestr)s”።

source: No %(verbose_name)s found matching the query
am: ጥያቄውን የሚመጥን ምንም %(verbose_name)s አልተገኘም።

source: Page is not “last”, nor can it be converted to an int.
am: ገጹ “last” አይደለም፣ ወይም ወደ ሙሉ ቁጥር ሊቀየር አይችልም።

source: Invalid page (%(page_number)s): %(message)s
am: የተሳሳተ ገጽ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
am: ባዶ ዝርዝር እና “%(class_name)s.allow_empty” ውሸት ነው።

source: Directory indexes are not allowed here.
am: የማውጫ ማውጫዎች እዚህ አይፈቀዱም።

source: “%(path)s” does not exist
am: “%(path)s” የለም

source: Index of %(directory)s
am: የ %(directory)s ማውጫ

source: The install worked successfully! Congratulations!
am: መጫኑ በተሳካ ሁኔታ ተጠናቋል! እንኳን ደስ አሎት!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
am: ለ Django %(version)s የ<a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">የመልቀቂያ ማስታወሻዎችን</a> ይመልከቱ።

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
am: ይህንን ገጽ እያዩ ያሉት በቅንብሮች ፋይልዎ ውስጥ <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> ስለሆነ እና ምንም URL ስላላዋቀሩ ነው።

source: Django Documentation
am: የዲጃንጎ (Django) ሰነዶች

source: Topics, references, &amp; how-to’s
am: ርዕሶች፣ ማጣቀሻዎች እና እንዴት-እንዴት ማድረግ እንደሚቻል

source: Tutorial: A Polling App
am: መማሪያ: የሕዝብ አስተያየት መስጫ መተግበሪያ

source: Get started with Django
am: በዲጃንጎ (Django) ይጀምሩ

source: Connect, get help, or contribute
am: ይገናኙ፣ እርዳታ ያግኙ ወይም አስተዋጽኦ ያድርጉ
