Repository: Anwar-tad/hulun_beand
Catalog: locale/om/LC_MESSAGES/django.po
Languages: om

source: English
om: Afaan Ingilizii

source: Amharic
om: Afaan Amhaaraa

source: Oromo
om: Afaan Oromoo

source: Inbox
om: Saanduqa Ergaa

source: Post Item
om: Meeshaa Maxxansi

source: Logout
om: Bahi

source: Login
om: Seeni

source: Register
om: Galmaa'i

source: Post Your Item
om: Meeshaa Kee Maxxansi

source: Welcome to
om: Baga Nagaan Gara

source: All in One Place
om: Waan Hundaa Bakka Tokkotti

source: Buy what you want, sell what you don't. Simple, fast, and reliable.
om: Waan barbaaddu biti, waan hin barbaanne gurguri. Salphaa, saffisaa fi amansiisaa.

source: Search here (e.g., Toyota Vitz)
om: Asitti barbaadi (fkn., Toyota Vitz)

source: Browse by Category
om: Ramaddiin Barbaadi

source: Latest Products
om: Meeshaalee Haaraa

source: Showing items in
om: Meeshaalee kan agarsiisu

source: Back to all categories
om: Gara ramaddiiwwan hundaa deebi'i

source: Search results for
om: Bu'aawwan barbaadii

source: No products found matching your criteria.
om: Meeshaan barbaadame hin argamne.

source: Previous
om: Isa Duraa

source: Next
om: Isa Itti Aanu

source: Welcome Back!
om: Baga Nagaan Deebitan!

source: Log in to discover great deals, or post your own items for sale. Your next opportunity is just a click away.
om: Gatii gaarii argachuuf yookiin meeshaalee keessan gurguruuf seenaa. Carraan keessan kan itti aanu cuqaasuu qofa.

source: Log In
om: Seeni

source: Username
om: Maqaa Fayyadamaa

source: Enter your username
om: Maqaa fayyadamaa keessan galchaa

source: Password
om: Jecha Darbii

source: Email Address
om: Teessoo Emeelii

source: Enter your email
om: Emeelii keessan galchaa

source: Confirm Password
om: Jecha Darbii Mirkaneessi

source: Product Name
om: Maqaa Meeshaa

source: Category
om: Ramaddii

source: Brand
om: Gosa

source: Condition
om: Haala

source: Location
om: Bakka

source: Price (in Birr)
om: Gatii (Birriin)

source: Description
om: Ibsa

source: Profile Picture
om: Suuraa Piroofayilii

source: Bio
om: Seenaa Gabaabaa

source: Phone Number
om: Lakkofsa Bilbilaa

source: Brand New
om: Haaraa Guutuu

source: Used
om: Kan Hojjetame

source: Refurbished
om: Kan Haarome

source: Join Our Community!
om: Hawaasa Keenyaatti Dabalamaa!

source: Create an account to start buying and selling in Ethiopia's fastest-growing marketplace.
om: Gabaa saffisaan guddataa jiru keessatti bituu fi gurguruu jalqabuuf herrega uummadhaa.

source: Create an Account
om: Herrega Uummadhaa

source: Email
om: Emeelii

source: Already have an account? <a href="{% url 'login' %}">Log in</a>
om: Kanaan dura herrega qabduu? <a href="{% url 'login' %}">Seenaa</a>

source: Don't have an account? <a href="{% url 'register' %}">Sign up</a>
om: Herrega hin qabduu? <a href="{% url 'register' %}">Galmaa'i</a>

source: Reset Password
om: Jecha Darbii Haaromsi

source: No Image Available
om: Suuraan Hin Jiru

source: Posted by:
om: Kan Maxxanfame:

source: on
om: guyyaa

source: Phone
om: Bilbila

source: Show Contact
om: Qunnamtii Agarsiisi

source: Chat with Seller
om: Gurguraa Waliin Haasa'i

source: Specifications
om: Amaloota

source: Like
om: Jaaladhu

source: Dislike
om: Hin Jaalatin

source: Edit
om: Fooyyessi

source: Delete
om: Haqi

source: Back to Home
om: Gara Fuula Jalqabaatti Deebi'i

source: Related Products
om: Meeshaalee Walsimatan

source: No related products found in this category.
om: Ramaddii kana keessatti meeshaan walfakkaatu hin argamne.

source: Update Product
om: Meeshaa Fooyyessi

source: Update Your Product
om: Meeshaa Keessan Haaromsi

source: Current Images
om: Suuraalee Ammaa

source: No images uploaded yet.
om: Hanga ammaatti suuraan ol hin fe'amne.

source: Upload New Images
om: Suuraalee Haaraa Ol Fe'i

source: this will replace all current images
om: kun suuraalee duraanii hunda ni bakka bu'a

source: Save Changes
om: Jijjiirama Olkaa'i

source: Profile
om: Piroofayilii

source: Contact
om: Qunnamtii

source: Edit Profile
om: Piroofayilii Fooyyessi

source: Items posted by
om: Meeshaalee kan maxxanse

source: Edit Item
om: Meeshaa Fooyyessi

source: Delete Item
om: Meeshaa Haqi

source: has not posted any products yet.
om: hanga ammaatti meeshaa tokkollee hin maxxansine.

source: Post Your First Item
om: Meeshaa Keessan Isa Jalqabaa Maxxansi
